<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"test-plan colours","backend":"cb3e4cb4c5db533d4fa3111c6f735665c447263f328ccee6c3bfab7b34d103d7","plan_job_ref":"Job Test terraform-plan #659 at https://github.com/dflook/terraform-github-actions/actions/runs/7848447453","plan_out_hash":"4f5c9b9d1998f83fe777a761ec1e032ee65a4be1e86bf178a4e12c55a38c66a2","plan_hash":"0669a54092b643566db47d7ea622ff2b02110a6934859b9832e5b40185e23950","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan for __test-plan colours__
<details>
<summary>Plan: 3 to add, 1 to change, 3 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_s3_object.update will be updated in-place
!~  resource "aws_s3_object" "update" {
!~      content                = "hello" -> "update"
        id                     = "test-plan-colours-test-object"
        tags                   = {}
+       version_id             = (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.add[0] will be created
+   resource "random_string" "add" {
+       id          = (known after apply)
+       length      = 3
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = true
+       upper       = true
    }

  # random_string.create_before_delete must be replaced
+/- resource "random_string" "create_before_delete" {
!~      id          = "****" -> (known after apply)
!~      length      = 4 -> 3 # forces replacement
!~      result      = "****" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # random_string.delete[0] will be destroyed
  # (because index [0] is out of range for count)
-   resource "random_string" "delete" {
-       id          = "02g" -> null
-       length      = 3 -> null
-       lower       = true -> null
-       min_lower   = 0 -> null
-       min_numeric = 0 -> null
-       min_special = 0 -> null
-       min_upper   = 0 -> null
-       number      = true -> null
-       numeric     = true -> null
-       result      = "02g" -> null
-       special     = true -> null
-       upper       = true -> null
    }

  # random_string.delete_before_create must be replaced
-/+ resource "random_string" "delete_before_create" {
!~      id          = "***" -> (known after apply)
!~      length      = 3 -> 4 # forces replacement
!~      result      = "***" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
+   add    = "hello"
-   delete = "goodbye" -> null
!~  update = "hello" -> "update"
```
</details>

:memo: Plan generated in [Test terraform-plan #659](https://github.com/dflook/terraform-github-actions/actions/runs/7848447453)